roam/20260217152829-powershell.org
:PROPERTIES:
:ID:       b0f15566-af50-4e78-adce-2d25bf90a911
:END:
#+TITLE: Powershell
#+FILETAGS: :wip:coding:

* Concepts
- ~PathType~s: ~leaf~ is a file, a ~container~ is a folder, and ~any~ is either.

* Querying
** =Get-ItemProperty=
 - For paths: Gets information about the directory.
 - For files: Retrieves properties of the file.
 - For registry entries: Value names and data of registry entries.

* Processing
** =Test-Path=
 - Check whether path exists.
 - ~PathType~ can be used to dictate type to check for.

* Supplying

