roam/public_html/20260217152829-powershell.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-17 Tue 16:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Powershell</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/custom.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href="/"><- home</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Powershell</h1>
</header><div id="outline-container-orgd955e16" class="outline-2">
<h2 id="orgd955e16">Concepts</h2>
<div class="outline-text-2" id="text-orgd955e16">
<ul class="org-ul">
<li><code>PathType~s: ~leaf</code> is a file, a <code>container</code> is a folder, and <code>any</code> is either.</li>
</ul>
</div>
</div>
<div id="outline-container-orgecf2581" class="outline-2">
<h2 id="orgecf2581">Querying</h2>
<div class="outline-text-2" id="text-orgecf2581">
</div>
<div id="outline-container-orgbc47099" class="outline-3">
<h3 id="orgbc47099"><code>Get-ItemProperty</code></h3>
<div class="outline-text-3" id="text-orgbc47099">
<ul class="org-ul">
<li>For paths: Gets information about the directory.</li>
<li>For files: Retrieves properties of the file.</li>
<li>For registry entries: Value names and data of registry entries.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbbd9cd4" class="outline-2">
<h2 id="orgbbd9cd4">Processing</h2>
<div class="outline-text-2" id="text-orgbbd9cd4">
</div>
<div id="outline-container-orgd53ba38" class="outline-3">
<h3 id="orgd53ba38"><code>Test-Path</code></h3>
<div class="outline-text-3" id="text-orgd53ba38">
<ul class="org-ul">
<li>Check whether path exists.</li>
<li><code>PathType</code> can be used to dictate type to check for.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org6672dfe" class="outline-2">
<h2 id="org6672dfe">Supplying</h2>
</div>
</div>
</body>
</html>
